public class Main {
    public static void main(String[] args) {
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

        int price = 10_000;
        int oneMiles = 20;
        int bonusMiles = price / oneMiles;
        System.out.println("Количество бонусных миль: " + bonusMiles);
    }
}